public class Main {
    public static void main(String[] args) {

        int pay = 5000;
        int bonus = 5000 / 20;
        int allMoney = pay + bonus;

        System.out.println(bonus);
        System.out.println(allMoney);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }}
